const allRows = [
  { id: "DARISANAM", title: "1️⃣ தரிசன நேரம்", description: "தரிசன நேர விவரம்" },
  { id: "ABISHEGAM_TIME", title: "2️⃣ அபிஷேகம் நேரம்", description: "அபிஷேக நேரம் & அலங்கார விவரம்" },
  { id: "ABISHEGAM_FEES", title: "3️⃣ அபிஷேகம் கட்டணம்", description: "அபிஷேகம் கட்டண விவரம்" },
  { id: "KATTANA_FEES", title: "4️⃣ கட்டணங்கள்", description: "கட்டண விவரம்" },
  { id: "PRARTHANA", title: "5️⃣ பிரார்த்தனை கட்டணம்", description: "பிரார்த்தனை கட்டணங்கள்" },
  { id: "PRASADHA", title: "6️⃣ பிரசாத திட்ட விவரங்கள்", description: "பிரசாத திட்ட விவரம்" },
  { id: "ANNADHANAM", title: "7️⃣ அன்னதானம்", description: "அன்னதான விதிகள்" },
  { id: "NANKODAI", title: "8️⃣ நன்கொடை", description: "நன்கொடைகள் & வழிகள்" },
  { id: "MUDIKANIKAI", title: "9️⃣ முடிகாணிக்கை", description: "முடிகாணிக்கை கட்டணம்" },
  { id: "PARKING", title: "🔟 பார்க்கிங்", description: "வாகன நிறுத்தம் & கட்டணம்" },
  { id: "MARRIAGE", title: "11️⃣ திருமணம்", },
  { id: "TEMPLE_PHOTO", title: "12️⃣ மூலவர் புகைப்படம்", description: "வடபழநி ஆண்டவர் படம்" },
];

module.exports = allRows;
