const allRows = [
  { id: "DARISANAM", title: "1️⃣ வழிபாட்டு நேரம்", description: "வழிபாட்டு நேரம்" },
  { id: "ABISHEGAM_TIME", title: "2️⃣ அபிஷேக நேரம்", description: "அபிஷேக நேரம் &  அலங்கார விவரம்" },
  { id: "ABISHEGAM_FEES", title: "3️⃣ அபிஷேகக் கட்டணம்", description: "அபிஷேகக் கட்டண விவரம்" },
  { id: "KATTANA_FEES", title: "4️⃣ கட்டணங்கள்", description: "கட்டண விவரம்" },
  { id: "PRARTHANA", title: "5️⃣ பிரார்த்தனைக் கட்டணம்", description: "பிரார்த்தனைக் கட்டணங்கள்" },
  { id: "PRASADHA", title: "6️⃣ பிரசாதம்", description: "பிரசாதத் திட்ட விவரம்" },
  { id: "ANNADHANAM", title: "7️⃣ அன்னதானம்", description: "அன்னதான விவரங்கள்" },
  { id: "NANKODAI", title: "8️⃣ நன்கொடை செலுத்த", description: "நன்கொடை விவரம் & வழிமுறை" },
  { id: "MUDIKANIKAI", title: "9️⃣ முடிகாணிக்கை", description: "முடிக்காணிக்கைக் கட்டணம்" },
  { id: "PARKING", title: "🔟 வண்டி நிறுத்தம்", description: "வாகன நிறுத்துமிடம்  & கட்டண விவரம்" },
  { id: "MARRIAGE", title: "11️⃣ திருமணம்", description: "திருமண கட்டணம் &  விவரங்கள்" },
  { id: "TEMPLE_PHOTO", title: "12️⃣ மூலவர் புகைப்படம்", description: "வடபழநி ஆண்டவர் படம்" },
];

module.exports = allRows;
