const allRows = [
  { id: "DARISANAM", title: "1️⃣ தரிசனம்", description: "தரிசன நேரம்" },
  { id: "ABISHEGAM_TIME", title: "2️⃣ அபிஷேகம்", description: "அபிஷேகம் நேரம் & அலங்கார விவரம்" },
  { id: "ABISHEGAM_FEES", title: "3️⃣ அபிஷேகம்", description: "அபிஷேகம் கட்டண விவரம்" },
  { id: "KATTANA_FEES", title: "4️⃣ கட்டணங்கள்", description: "திருக்கல்யாணம் & அபிஷேகம்" },
  { id: "PRARTHANA", title: "5️⃣ பிரார்த்தனை", description: "பிரார்த்தனை கட்டணங்கள்" },
  { id: "PRASADHA", title: "6️⃣ பிரசாதம்", description: "பிரசாத திட்ட விவரம்" },
  { id: "ANNADHANAM", title: "7️⃣ அன்னதானம்", description: "அன்னதான விதிகள்" },
  { id: "NANKODAI", title: "8️⃣ நன்கொடை", description: "நன்கொடைகள் & வழிகள்" },
  { id: "MUDIKANIKAI", title: "9️⃣ முடிகாணிக்கை", description: "முடிகாணிக்கை கட்டணம்" },
  { id: "PARKING", title: "🔟 பார்க்கிங்", description: "வாகன நிறுத்தம் & கட்டணம்" },
  { id: "MARRIAGE", title: "11️⃣ திருமணம்", description: "திருமணச் சான்றிதழ்" },
  { id: "TEMPLE_PHOTO", title: "12️⃣ படம்", description: "வடபழநி ஆண்டவர் படம்" },
];

module.exports = allRows;
