const MESSAGES = {
  WELCOME_MENU: `வடபழநி கோயில் தங்களை வரவேற்கிறோம்,
1. தலவரலாறு
2. பூஜை விபரம்
3. கட்டண தரிசனம்`,

  TALAVARALAR: `அருள்மிகு வடபழநி ஆண்டவர் திருத்தலம் 19-ம் நூற்றாண்டின் இறுதியில் கட்டப்பட்டது. முதன் முதலில் சிறிய ஓலைக்கூரைக் கொட்டகை அமைக்கப்பட்டு, அதில் முருகனுடைய வண்ண ஓவியப்படம் வைத்து தீவிர முருக பக்தரான அண்ணாசாமி நாயக்கர் என்பவர் வழிபட்டு வந்தார். தீராத வயிற்று வலியால் அவதிப்பட்ட முருகபக்தரான அவர் திருத்தணி, திருப்போரூர் ஆகிய திருமுருகன் திருத்தலங்களுக்கு, கடும் புயலிலும் மழையிலும் திருடர் இடைமறித்தாலும் கூட தவறாது சென்று வழிபட்டவர். அவரின் கனவில் ஒரு பெரியவர் தோன்றி உன் வீட்டிலேயே முருகன் குடியிருக்கும் போது நீ ஏன் இங்கு அவனைத் தேடிக் கொண்டு அல்லல்பட்டு ஓடி வருகின்றாய்? அங்கேயே நீ முருகனை வழிபட்டு மகிழலாமே என கூறக்கேட்டு, உறக்கத்திலிருந்து திடுமென விழித்து எழுந்து, முருகன் அருளை நினைத்து உருகித் தொழுது, வீட்டுக்குத் திரும்ப வந்து சேர்ந்தார்.

நடந்த சம்பவத்தை வீட்டிலுள்ளவர்களுக்கு அறிவித்து அன்று முதல் தம் வீட்டிலேயே காலை, மாலை, இரு வேளைகளிலும் முருகனை நினைத்து வழிபாடு செய்து வந்தார். ஒரு நாள் தான் சந்தித்த பழநி சாது தெரிவித்தது போன்று திருத்தணியில் முருகன் சன்னதி எதிரில் புதுமையான காணிக்கையாக தனது நாக்கை அறுத்து பாவாடம் தரித்து கொண்ட பின் வயிற்று வலி தீரப் பெற்றார். அதன் பிறகு நீண்ட நாள் கனவாக இருந்த, தென் பழநி யாத்திரையின் போது ஞான தண்டாயுதபாணியை மலைமேல் சென்று தரிசித்துக் கொண்டு படிகளின் கீழிறங்கி வந்தார். வழியில் இருந்த படக்கடை ஒன்றில் பழநியாண்டவரின் பெரிய அழகிய படம் ஒன்று அவர் கண்களைக் கவர்ந்தது. அதன்பால் அவர் பெறவுமான அதிசயம் நிகழ்ந்தது. அப்படி பழனியில் பெற்ற முருகனின் திருவுருவப் படத்தினை நாயகர் அவர்கள் அந்தப் படத்தை பெருஞ் செல்வமாக மதித்துப் போற்றி எடுத்துக் கொண்டு சென்னைக்கு வந்தார்.

தமது குறிமேடையில் அவ்வுருவப்படத்தினை வைத்து பழநி ஆண்டவர் திருக்கோயிலாக மாற்றி அமைத்தார். சிறிய கீற்றுக் கொட்டகையொன்று போட்டுவித்துத் தம் குடும்பத்தை வேறிடத்திற்கு இடம் பெயரச் செய்தார். பழநி ஆண்டவர் படத்திற்கு பூஜை செய்து வழிபட்டு பக்தர்களுக்கெல்லாம் குறி சொல்லி அவர்களது குறைகளுக்கு தீர்வு சொல்லி வந்தார். பாவாடம் - நாக்கை அறுத்து இறைவனுக்கு காணிக்கையாக செலுத்தும் வழக்கத்திற்கு பாவாடம் என்று மக்கள் கூறுவர். அதன் பிறகு தன்னிடம் தொண்டு செய்து வந்த இரத்தினசாமி செட்டியாரின் அன்பையும் ஆர்வத்தையும் அறிந்த தம்பிரான் சிலகாலம் கழித்து, தமக்குப்பின் இவ்வழிபாட்டைத் தொடர்ந்து செய்யக் கூடியவர் இவரே ஆவர் எனத் தேர்ந்து, இரத்தினசாமி செட்டியாரை அன்புடன் அருகில் அழைத்து நீர் இங்கேயே இருந்து ஆண்டவருக்குத் தொண்டு செய்தல் இயலுமா? என்று வினவினார்.

இரத்தினசாமி செட்டியார் எதிர்பாராத நிலையில் வினா எழவே மிகவும் தயங்கி அடியேன் குடும்பத்தவன் ஆயிற்றே என்னால் எங்ஙனம் இயலும்? ஏதேனும் இயன்ற தொண்டுகளை மட்டும் நான் செய்து வருவேன் என்று பணிவுடன் தெரிவித்தார். அது கேட்ட தம்பிரான் இக்கீற்றுக் கொட்டகையை மாற்றி இங்கு பழநி ஆண்டவருக்கு ஒரு சிறிய கோயில் கட்ட வேண்டுமென்று என் உள்ளம் விரும்புகின்றது. தாங்கள் இதற்கு ஏதேனும் உதவி செய்தல் இயலுமா? என்றார். உடனே செட்டியார் அப்படியே செய்யலாம், தாங்கள் விருப்பம் போலவே அன்பர்களுக்கும் இக்கருத்து உள்ளது. தாங்களே வாய்திறந்து பணித்த பின்னர் அதனை நிறைவேற்றுவதில் என்ன தடை? இன்றைக்கே கோயில் திருப்பணிக்கு உரிய ஏற்பாடுகளைச் செய்யலாம்.

தாங்கள் இசைவு தெரிவித்தால், பழநி ஆண்டவர் சிலை ஒன்றையும் அழகுற அமைப்பித்துத் திருக்கோயில் நிறுவிக் கும்பாபிஷேகமும் விரைவில் செய்துவிடலாம் என்று மிகவும் பேரார்வத்துடன் தெரிவித்தார். அண்ணாசாமித் தம்பிரான் ஆண்டவன் பணிக்கு எம்முடைய இசைவு எதற்கு? தங்கள் உள்ளத்தில் தோன்றுகிறபடியே திருப்பணிக்கு ஏற்பாடு செய்யுங்கள் என்று சொல்லிச் செட்டியாருக்கு திருநீறு கொடுத்து அனுப்பி விட்டார்.

செட்டியார் வண்ணையம்பதி சென்று தமக்குத் தெரிந்த ஒரு ஸ்தபதியாரிடம் பழநி ஆண்டவர் சிலையொன்று செய்யும்படி மறுநாளே ஏற்பாடு செய்தார். அண்ணாசாமித் தம்பிரானின் திருஉலக் குறிப்பின்படி கோயில் திருப்பணியை முன்நின்று செய்யத் தொடங்கினார். குறிமேடைக்கு அருகில், இப்போது வடபழநி ஆண்டவர் திருக்கோயிலில் கருவறைப்பகுதி உள்ள இடத்தில், செங்கல், சுண்ணாம்புக் கட்டிடம் ஒன்று அமைக்கப் பெற்றது. அன்பர்கள் பலர் செய்த பொருளுதவியினால் திருப்பணி விரைவில் நிறைவேறியது. இது சுமார் கி.பி.1865-ம் ஆண்டாக இருக்கலாமென தெரிகிறது. இந்நிலையில் திடீரென்று ஒருநாள் ஆவணி மாதம் அமாவாசைத் திதி, மக நட்சத்திரத்தன்று அண்ணாசாமித் தம்பிரான் ஆண்டவர் திருவடியை அடைந்துவிட்டார்.

ஒருநாள் இரத்தினசாமி செட்டியார் கனவில் ஸ்ரீ அண்ணாசாமி தம்பிரான் தோன்றி அவரையும் தம்மை போலவே பாவாடம் தரித்துக் கொள்ளுமாறு பணிந்தார். அவ்வாறே ஆடிக்கிருத்திகை அன்று இரத்தினசாமி செட்டியாரும் பாவாடம் தரித்துக் கொண்டார். அடுத்த கிருத்திகை முதல் இரத்தினசாமி தம்பிரானும் ஆவேசமுற்றுக் குறி சொல்லும் ஆற்றல் பெற்றார். பின் சில நாட்களில் அண்ணாசாமி தம்பிரான் விரும்பியபடியே தொடங்கப் பெற்ற கோயில் திருப்பணி சிறப்புற நிறைவேறியது. பழநியாண்டவர் சிலையும் பிரதிஷ்டை செய்யப் பெற்று கும்பாபிஷேகமும் நன்கு நிறைவேறியது. வழக்கம் போல் குறி கேட்க வரும் அன்பர்கள் கொடுக்கும் காணிக்கைப் பொருளைக் கொண்டே இரத்தினசாமி தம்பிரான் திருக்கோயில் பூசை முதலிய செலவுகளை நன்முறையில் நடத்திக் கொண்டு வந்தார்.

கும்பாபிஷேகத்திற்குப் பிறகு கோடம்பாக்கம் குறிமேடையை வடபழநி ஆண்டவர் கோயில் என்று வழங்கும்படி இரத்தினசாமித் தம்பிரான் அனைவரிடமும் கூறி வந்தார். நாளடைவில் வடபழநிக் கோயிலின் புகழ் சென்னை நகர் முழுவதும் விரைந்து பரவுவதாயிற்று. 1886-ம் ஆண்டு மார்கழி மாதம் சஷ்டி நாளில் சதய நட்சத்திரத்தன்று ஸ்ரீ இரத்தினசாமி தம்பிரான் இறைவன் திருவடி நிழலை அடைந்தார். அவருக்கு பின்னர் அவரது சீடர் பாக்கியலிங்க தம்பிரான் என்பவர் குருவின் திருவுள்ளக் குறிப்பிற்கேற்ப பாவாடம் தரித்துக் கொண்டு அருள்வாக்கு சொல்லி முன்னவரைப் பின்பற்றினார். இப்போதுள்ள வடபழநி திருக்கோயிலின் கர்ப்ப கிருகமும், முதல் உட்பிரகாரத் திருச்சுற்றும், கருங்கல் திருப்பணி ஆகியவற்றை செய்வித்தவர் ஸ்ரீ பாக்யலிங்கத் தம்பிரான் அவர்களேயாவர்.

இவர்தம் அரும்பெரும் முயற்சிகளின் பயனாகவே, ஸ்ரீ வடபழநி ஆண்டவர் கோயில் மிகவும் புகழ் பெறுவதாயிற்று, அன்பர்கள் பெருந்திரளாகக் கூடி வந்தனர். கோயில் வளர்ச்சியும் புகழும் நாளடைவில் பெருகின. இந்நிலையில் 1931-ம் ஆண்டு புரட்டாசித் திங்கள் தசமி திதி கூடிய பூச நட்சத்திரத்தன்று ஸ்ரீ பாக்யலிங்கத் தம்பிரான் பழநியாண்டவர் திருவடியைப் பாங்குற அடைந்தார்.
தென்பழநி ஆண்டவர் வேண்டுவோருக்கு வேண்டும் வரனை அளிப்பது போல தமிழகத்தின் வடபகுதியாம் சென்னையில் வடபழநி ஆண்டவராக அனைத்து வரங்களையும் அருளிக்கொண்டு வடபழநி ஆண்டவர் அருள்பாலித்து வருகிறார். பழநிக்கு சென்று வேண்டுதலை நிறைவேற்ற முடியாதவர்கள் இத்தலத்திற்கு வந்து பழநி மலை முருகனுக்கு நிறைவேற்ற நினைத்த வேண்டுதலை நிறைவேற்றி தென்பழநி முருகனின் அருளை இந்த வடபழநி முருகன் ஆலயத்திலேயே பெற்றுள்ளார்கள் என்பது ஒரு நிதர்சனமான நிகழ்வாகும். பழனி முருகனிடம் வேண்ட நினைத்த காரியங்களையும் வடபழநி ஆண்டவரிடமே வேண்டி அவர் அருளைப் பெற்றவர்கள் ஏராளம். நாளாக நாளாக இத்திருக்கோயிலின் புகழ் மேலும் வளர்ந்து வேண்டுவோர்க்கு வேண்டும் வரம் அளிக்கும் பிரார்த்தனை ஸ்தலமாக உயர்ந்து வருகிறது.
இத்திருக்கோயிலை உருவாக்கிய மூன்று சித்தர்களும் சமாதி அடைந்த இடம் இத்திருக்கோயிலுக்கு அருகில் உள்ள நெற்குன்றம் பாதையில் உள்ளது. அந்த இடத்தில் சித்தர்கள் ஆலயம் அமையப்பெற்று ஒரே நேரத்தில் மூவரின் சமாதிகளை தரிசிக்கும் வகையில் கட்டப்பட்டுள்ளது. பௌர்ணமி தோறும் சிறப்பு பூஜைகள் நடத்தப்பட்டு வருகிறது. குரு பூஜையும் சிறப்பாக செய்யப்பட்டு வருகிறது.
திருமணத் தடை விலகவும் மற்றும் மக்கட்பேறு பெறவும் சிறந்த கல்வி அறிவு பெறவும், உடல் நலத்துடன் ஆரோக்கியமாக இருக்கவும் மூலவரையும், அங்காரகனையும் (செவ்வாய்) வழிபாடு செய்து சிறப்பு அபிஷேகம் மற்றும் அர்ச்சனை செய்பவர்களுக்கு குறைகள் நீங்கி நிவர்த்தி ஏற்படும் என்பது இத்தலத்தின் மிகப்பெரிய சிறப்பு. கலியுக வரதனான வடபழநி ஆண்டவர் அருள்பாலிப்பது திண்ணம்.
இத்திருக்கோயில் மூலவர் பாத காலணிகளுடன் அருள்பாலிப்பது சிறப்பு. வேறு எந்த படைவீட்டிலும் காண முடியாது. பாத காலணிகள் அணிந்து இருப்பது ஆணவத்தையும், அகங்காரத்தையும் அடியோடு நீக்குவதைக் குறிக்கிறது. இத்திருக்கோயிலின் மூலவரின் வலது காலானது சற்று முன்வந்தது போல் காணப்படுவது பக்தர்களின் குறைகளை இக்கலியுகத்தில் விரைந்து வந்து வடபழனி ஆண்டவர் உடன் நீக்குவதாக ஐதீகம்.
இத்திருக்கோயிலின் தல விருட்சம் அத்தி மரம் ஆகும். குழந்தைகள் வரம் வேண்டி அத்தி மரத்தில் பக்தர்கள் தொட்டில் கட்டி வருகின்றனர். பக்தர்களின் வேண்டுதலை விரைந்து தீர்த்து வைக்கின்ற காரணத்தால் பிரார்த்தனை தலமாக உயர்ந்து, வேண்டுவோர்க்கு வேண்டும் வரம் கிடைக்கிறது. பிரார்த்தனை செய்து கொள்ளும் பக்தர்கள் காணிக்கையாக பொன், வெள்ளி செலுத்துதலும், வேல், ரொக்கம் போன்றவை உண்டியலில் செலுத்துதலும், புடவை சாத்துதலும், மொட்டையடித்தல், காது குத்துதல், பால்காவடி, புஷ்ப காவடி எடுத்தலும் தனி சிறப்பாகும்.`,


  POOJA_VIPARAM: `பள்ளியறை பூஜை 05:30 AM - 06:00 AM
காலசந்தி பூஜை 06:30 AM - 06:45 AM
உச்சிகால பூஜை 12:00 PM - 12:30 PM
சாயரட்சை பூஜை 05:00 PM - 06:45 PM
அர்த்தஜாம பூஜை 09:00 PM`,

  KATTANA: `பால் அபிஷேகம் 700.00
சந்தனகாப்பு 3700.00
சங்காபிஷேகம் 6500.00
திருகல்யாணம் 8500.00`
};

module.exports = MESSAGES;
