// utils/messages.js

const MESSAGES = {
  DARISANAM: `
🌸 தரிசனம்

வார நாட்கள்:
- காலை 5.00 மணி முதல் பகல் 12.30 மணி வரை
- மாலை 4.00 மணி முதல் இரவு 9.00 மணி வரை

செவ்வாய் - வெள்ளி:
- காலை 5.00 மணி முதல் பகல் 12.30 மணி வரை
- மாலை 4.00 மணி முதல் இரவு 9.30 மணி வரை

கிருத்திகை நாட்களில்:
அதிகாலை 4.00 மணி முதல் இரவு 10.30 மணி வரை

**⚠️ திருவிழா காலங்களில் நேரம் மாறதற்கு உபட்டது ⚠️**

`,

  ABISHEGAM_TIME: `
🕉️ அபிஷேகம்

🌼 பள்ளியறை பூஜை (சாதாரண அலங்காரம்)
காலை 5.30 மணி முதல் காலை 6.00 மணி வரை

🌼 காலசந்தி பூஜை (சாதாரண அலங்காரம்)
காலை 6.30 மணி முதல் காலை 6.45 மணி வரை

🌼 உச்சிக்கால பூஜை (சந்தனகாப்பு)
மதியம் 12.00 மணி முதல் மதியம் 12.30 மணி வரை

🌼 சாயரட்சை பூஜை (சந்தனகாப்பு)
மாலை 5.00 மணி முதல் மாலை 6.45 மணி வரை

🌼 அர்த்தஜாம பூஜை (அலங்காரம் இல்லை)
இரவு 9.00 மணி
`,

  ABISHEGAM_FEES: `
💰 அபிஷேகம் கட்டணம்


- 108 சங்காபிஷேகம் - ₹6,500.00
- பால் அபிஷேகம் - ₹700.00

மேலும் விவரங்களுக்கு அலுவலகத்தை அணுகவும்.
`,

  KATTANA_FEES: `
📜 கட்டண விவரங்கள்



`,

  PRARTHANA: `
🙏 பிரார்த்தனை

பிரார்த்தனை கட்டணங்கள்:
- தனிப்பட்ட பிரார்த்தனை: ₹100
- குழு பிரார்த்தனை: ₹300
நேரம் மற்றும் முன்பதிவு தொடர்புகள்: கோயில் அலுவலகம்
`,

  PRASADHA: `
🍛 பிரசாதம்

பிரசாத திட்ட விவரம்:
- நாளொன்றுக்கு 500 பேருக்கு
- தனிப்பட்ட பிரசாதம்: ₹50
மேலும் விவரங்களுக்கு கோயில் அலுவலகத்தை அணுகவும்.
`,

  ANNADHANAM: `
🍚 அன்னதானம்

எல்லா நாட்களும் அன்னதானத்திற்கு நன்கொடை செலுத்தலாம். நேரிலோ அல்லது இணைய வழி வாயிலாகவோ செலுத்தலாம். 

தங்களின் பிறந்த நாள், திருமண நாள் போன்ற முக்கிய நாட்களுக்கு நன்கொடை செலுத்தி அன்னதானம் வழங்கலாம். 

தங்களின் பெயர் அறிவிப்பு பலகையில் போடப்படும். 
`,

  NANKODAI: `
🎁 நன்கொடை

எல்லா நாட்களும் நன்கொடை செலுத்தலாம். நேரிலோ அல்லது இணைய வழி வாயிலாகவோ செலுத்தலாம். 
`,

  MUDIKANIKAI: `
💐 முடிகாணிக்கை

முடிகாணிக்கை கட்டணம் கிடையாது. எல்லா நாட்களும் முடிகாணிக்கை செலுத்த வசதி உள்ளது.

அருகிலே குளியலறை உள்ளது. சுடு தண்ணீர் வசதி உள்ளது. 
`,

  PARKING: `
🚗 பார்க்கிங்

1. மூன்று இடங்களில் இரண்டு சக்கர வாகனம் நிறுத்தம் உள்ளது. 

வாகன நிறுத்த கட்டணம் - Rs 5/- 

a. நான்கு முனை சந்திப்பு (தெற்கு)
b. திருக்குளத்தின் வடக்கு புறம்
c. கோசாலை அருகில்

2. நான்கு சக்கர வாகன நிறுத்தம் 

வாகன நிறுத்த கட்டணம் - Rs 20/- 

திருக்கோயில் வடக்கு புறம் உள்ள திருக்கோயிலின் கல்யாண மண்டபம் எதிரே உள்ளது.
`,

  MARRIAGE: `
💍 திருமணம்

திருக்கோவிலில் திருமணம் செய்ய
தேவையான சான்றிதழ்களை சமர்பித்து விண்ணப்படிவத்தை பெற வேண்டும்

தேவையான சான்றிதழ்கள்

மணமகன் மற்றும் மனமகள் இருவருக்கும்

1. ஆதார் கார்டு
2. PAN கார்டு
3. கல்வி சான்றிதழ்கள்
4. சாதி சான்றிதழ் or TC 
5. முதல் திருமணம் சான்றிதழ்

திருமண கட்டணம் Rs 5565/-
`,
  PHOTO: {
    type: "image",
    url: 'https://your-public-url.ngrok.io/temple-photo.jpg.jpeg',
    caption: "📸 அருள்மிகு வட பழநி ஆண்டவர் திருக்கோயில் புகைப்படம் 🙏",
  },


};

module.exports = MESSAGES;
