const MESSAGES = {
  WELCOME_MENU: `வடபழநி கோயில் தங்களை வரவேற்கிறோம்,
1. தலவரலாறு
2. பூஜை விபரம்
3. கட்டண தரிசனம்`,

  TALAVARALAR: `அருள்மிகு வடபழநி ஆண்டவர் திருத்தலம் ...
(👉 paste full தலவரலாறு text here 👈)`,

  POOJA_VIPARAM: `பள்ளியறை பூஜை 05:30 AM - 06:00 AM
காலசந்தி பூஜை 06:30 AM - 06:45 AM
உச்சிகால பூஜை 12:00 PM - 12:30 PM
சாயரட்சை பூஜை 05:00 PM - 06:45 PM
அர்த்தஜாம பூஜை 09:00 PM`,

  KATTANA: `பால் அபிஷேகம் 700.00
சந்தனகாப்பு 3700.00
சங்காபிஷேகம் 6500.00
திருகல்யாணம் 8500.00`
};

module.exports = MESSAGES;
