const MESSAGES = {
  WELCOME_MENU: `வடபழநி கோயில் தங்களை வரவேற்கிறோம்,
1. தலவரலாறு
2. பூஜை விபரம்
3. கட்டண தரிசனம்
4. திருமணம் பற்றிய விவரங்கள்`,

  TALAVARALAR: `அருள்மிகு வடபழநி ஆண்டவர் திருத்தலம் 19-ம் நூற்றாண்டின் இறுதியில் கட்டப்பட்டது. முதலில் சிறிய ஓலைக்கூரைக் கொட்டகையில் முருகனுடைய வண்ண ஓவியப்படம் வைத்து, தீவிர முருக பக்தரான அண்ணாசாமி நாயக்கர் வழிபட்டார். தீராத வயிற்று வலியால் அவதிப்பட்ட அவர் திருத்தணி, திருப்போரூர் போன்ற திருத்தலங்களுக்கு, கடும் புயலிலும் மழையிலும் போய்வழிபட்டவர். கனவில் ஒரு பெரியவர் தோன்றி, “உன் வீட்டிலேயே முருகன் குடியிருக்கிறார், அங்கே வழிபட்டு மகிழ்” என கூறினார். அண்ணாசாமி நாயக்கர் விழித்து எழுந்து, முருகனை நினைத்து வழிபட்டார்; வயிற்றுவலி தீர்ந்தது.

அந்த சம்பவத்தை குடும்பத்தினரிடம் பகிர்ந்து, அன்றிலிருந்து காலை-மாலை வீட்டிலேயே முருகனை வழிபட்டார். ஒரு நாள், பழனி சாது தெரிவித்தபடி திருத்தணியில் முருகன் சன்னதி எதிரில் புதுமையான காணிக்கையாக நாக்கு அறுத்து பாவாடம் தரித்தார்; அன்புடன் வழிபட்டு அருளைப் பெற்றார். தென் பழனி யாத்திரையின் போது ஞான தண்டாயுதபாணியை மலைமேல் சென்று தரிசித்து, படிகளின் கீழிறங்கி வந்தார். வழியில் பழநியாண்டவரின் அழகிய படம் கண்களை கவர்ந்தது. அதன் மூலம் அண்ணாசாமி நாயக்கர் அற்புதங்களைப் பெற்றார்.

அன்பு பக்தர்களுக்கான குறி தீர்வு வழங்கும் வகையில், தமது குறிமேடையில் அவ்வுருவப்படத்தை வைத்து பழநி ஆண்டவர் திருக்கோயிலாக அமைத்தார். சிறிய கீற்றுக் கொட்டகையொன்று போட்டுவிட்டு குடும்பத்தை வேறு இடம் மாற்றினார். பாவாடம் வழக்கத்தை மக்கள் பின்பற்றி வந்தனர். தம்பிரான் இரத்தினசாமி செட்டியாரை தேர்ந்தெடுத்து, அவரின் உதவியுடன் சிறிய கோயில் கட்டப்பட்டது. கும்பாபிஷேகமும் சிறப்பாக நடந்தது, வழிபாட்டில் பக்தர்கள் பெருந்திரளாக கலந்து அருளைப் பெற்றனர்.

பழநியாண்டவர் சிலையும் பிரதிஷ்டை செய்து, திருப்பணி நிறைவேற்றப்பட்டது. தம்பிரான் வழிபாட்டு வழக்கங்களை நன்கு முன்னேற்றினார். 1886-ம் ஆண்டு மார்கழியில், ஸ்ரீ இரத்தினசாமி தம்பிரான் இறைவன் திருவடி நிழலை அடைந்தார். அவரது சீடர் பாக்கியலிங்க தம்பிரான் குருவின் திருவுள்ளக் குறிப்பை பின்பற்றி பாவாடம் தரித்தார். இப்போதுள்ள வடபழநி திருக்கோயிலின் கர்ப்ப கிருகம், முதல் உட்பிரகாரம், கருங்கல் திருப்பணி போன்றவை ஸ்ரீ பாக்யலிங்கத் தம்பிரான் செய்ததாகும்.

இதன் மூலம் வடபழநி ஆண்டவர் கோயில் புகழ் பெற்றது; பக்தர்கள் பெருந்திரளாகக் கூடி வந்தனர். 1931-ம் ஆண்டு புரட்டாசித் திங்கள் தசமி திதியில் பாக்யலிங்கத் தம்பிரான் பழநியாண்டவர் திருவடியைப் பாங்குற அடைந்தார். வடபழநி ஆண்டவர் கோயிலில் வேண்டுதல்கள் நிறைவேற்றப்படுவதால் மக்கள் பெருமளவு களவைத்து வந்தனர். கோயிலில் மூலவர் பாத காலணிகள் அணிந்து அருள்பாலிப்பது, பக்தர்களின் குறைகளை நீக்கும் சிறப்பு கொண்டது.

திருக்கோயிலின் தல விருட்சம் அத்தி மரம்; பக்தர்கள் குழந்தைகளுக்கு வரம் வேண்டி இதை தொட்டுக் கட்டி வருகின்றனர். பிரார்த்தனை செய்து கொண்ட பக்தர்கள் காணிக்கையாக பொன், வெள்ளி செலுத்தும் வழக்கம் உள்ளது; வேல், ரொக்கம், புடவை சாத்துதல், மொட்டையடித்தல், காது குத்துதல், பால்காவடி, புஷ்ப காவடி போன்றவை சிறப்பாக நடைபெறுகின்றன.

பழநி ஆண்டவர் கோயிலின் வளர்ச்சி மற்றும் புகழ் நாளடைவில் பெருகியது. அன்பர்கள், பக்தர்கள், மற்றும் வழிபாட்டு வழக்கங்களை முன்னேற்றும் மூவரும் இந்தக் கோயிலின் அருகில் உள்ள நெற்குன்றம் பாதையில் சமாதி அடைந்துள்ளனர். பௌர்ணமியிலும் குருபூஜையும் சிறப்பாக நடத்தப்படுகிறது. திருமணத் தடை நீங்க, மக்கட்பேறு பெற, கல்வி வளர்ச்சி, உடல் நலம், ஆரோக்கியம் போன்ற பல நன்மைகள் இந்த தலத்தில் வழிபாடு செய்தால் கிடைக்கும்.`,


  POOJA_VIPARAM: `பள்ளியறை பூஜை 05:30 AM - 06:00 AM
காலசந்தி பூஜை 06:30 AM - 06:45 AM
உச்சிகால பூஜை 12:00 PM - 12:30 PM
சாயரட்சை பூஜை 05:00 PM - 06:45 PM
அர்த்தஜாம பூஜை 09:00 PM`,

  KATTANA: `பால் அபிஷேகம் 700.00
சந்தனகாப்பு 3700.00
சங்காபிஷேகம் 6500.00
திருகல்யாணம் 8500.00`,

MARRIAGE: `திருக்கோவிலில் திருமணம் செய்ய
தேவையான சான்றிதழ்களை சமர்பித்து விண்ணப்படிவத்தை பெற வேண்டும்

தேவையான சான்றிதழ்கள்

மணமகன் மற்றும் மனமகள் இருவருக்கும்

1. ஆதார் கார்டு
2. PAN கார்டு
3. கல்வி சான்றிதழ்கள்
4. சாதி சான்றிதழ் or TC 
5. முதல் திருமணம் சான்றிதழ்

திருமண கட்டணம் Rs 5565/-`

};

module.exports = MESSAGES;
