// utils/messages.js

const MESSAGES = {
DARISANAM: `
🌸 *தரிசன நேரங்கள் (Darisanam Timings)*

*வார நாட்கள் (திங்கள் – ஞாயிறு)*
- காலை  5:00 மணி — 12:30 மணி
- மாலை  4:00 மணி — 9:00 மணி

*செவ்வாய் & வெள்ளி*
- காலை  5:00 மணி — 12:30 மணி
- மாலை  4:00 மணி — 9:30 மணி

*கிருத்திகை நாட்கள்*
- அதிகாலை 4:00 மணி — இரவு 10:30 மணி

*⚠️ திருவிழாக் காலங்களில் நேரம் மாறுதலுக்கு உட்பட்டது ⚠️*
`,


  ABISHEGAM_TIME: `
🕉️ *அபிஷேக நேரம் & அலங்கார விவரம்*

🌼 *பள்ளியறைப் பூஜை (சாதாரண அலங்காரம்)*
- காலை 05.30 மணி முதல் காலை 06.00 மணி வரை

🌼 *காலசந்திப் பூஜை (சாதாரண அலங்காரம்)*
- காலை 6.30 மணி முதல் காலை 6.45 மணி வரை

🌼 *உச்சிக்காலப் பூஜை (சந்தனக்காப்பு அலங்காரம்)*
- மதியம் 12.00 மணி முதல் மதியம் 12.30 மணி வரை

🌼 *சாயரட்சைப் பூஜை (சந்தனக்காப்பு அலங்காரம்)*
- மாலை 5.00 மணி முதல் மாலை 6.45 மணி வரை

🌼 *அர்த்தஜாமப் பூஜை (அலங்காரம் இல்லை)*
- இரவு 9.00 மணி
`,

ABISHEGAM_FEES: `
💰 *அபிஷேகக் கட்டண விவரம்*

- 108 சங்காபிஷேகம் – ரூ.6500/-
- சந்தனக்காப்பு (காலை 11.00 & மாலை 05.00 மணிக்கு) – ரூ.3700/-
- விபூதி, பஞ்சாமிருத அபிஷேகம் (சித்தர் ஆலயத்தில் மட்டும்)  – ரூ.1700/-  
- பால் அபிஷேகம் – ரூ.700/- 

🌐 முன்பதிவு செய்ய 👇  
🔗(https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collectionindex.php?tid=6&scode=21&sscode=1&target_type=1&group_id=4)

📞 மேலும் விவரங்களுக்கு அலுவலகத்தை அணுகவும்.
`
,

KATTANA_FEES: `
📜 *•	கட்டண விவரம்*

- அன்னைத் தமிழ் அர்ச்சனை – ரூ.5/-  
- அர்ச்சனை டிக்கெட் – ரூ.5/- 
- அன்னப்பிரசன்னம் – ரூ.150/-
- சிறப்பு வழிபாட்டுக் கட்டணச்சீட்டு (சாதாரண நாள்கள்) – ரூ.100/-  
- சிறப்பு வழிபாட்டுக் கட்டணச்சீட்டு (விழா நாள்கள்) – ரூ.100/-
- காது குத்துதல் – ரூ.100/-
- முடிக்காணிக்கை – இலவசம்
- நிச்சயதார்த்தம் – ரூ.3000/-
- மணமகன் மற்றும் மணமகள் அழைப்பு – ரூ.1000/-
- கேமரா புகைப்படக் கட்டணம் – ரூ.500/-
- கேமரா வீடியோக் கட்டணம் – ரூ.1000/-
- பலவகை இரசீது – ரூ.500/-


🌐 முன்பதிவு செய்ய 👇  
🔗 (https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collectionindex.php?tid=6&scode=21&sscode=1&target_type=1&group_id=4)
`
,

PRARTHANA: `
🙏 *பிரார்த்தனைக் கட்டணங்கள்*

- திருக்கல்யாணம் நடத்துதல்  – ரூ.8500/-
- தங்கரதம் இழுத்தல்  – ரூ.2500/- 
- வடை மாலை சாத்துதல்  – ரூ.700/- 
- உச்சிக்கால நெய்வேதியம் (10கிலோ) - ரூ.3000/-
- நெய்த்திட்டம் – ரூ.7500/-
- நல்லெண்ணெய்த் திட்டம் – ரூ.6000/- 
- துலாபாரத் திட்டம் – ரூ.800/-  
- நெய் விளக்கு (எண்ணிக்கை 2) – ரூ.15/-  
- நல்லெண்ணெய் விளக்கு (எண்ணிக்கை 2) – ரூ.15/-

🌐 முன்பதிவு செய்ய 👇 
🔗(https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collectionindex.php?tid=6&scode=21&sscode=1&target_type=1&group_id=4)
`
,

  PRASADHA: `
*🍛 •	பிரசாதத் திட்ட விவரம்*

- நாள் முழுவதும் பிரசாதம் - ரூ.5000/-
- சர்க்கரைப் பொங்கல் (1 கிலோ) - ரூ.750/-
- புளியோதரைக் கட்டணம் (1 கிலோ - ரூ.600/-
- வெண்பொங்கல் கட்டணம் (1 கிலோ) - ரூ.500/-

🌐 முன்பதிவு செய்ய 👇 
🔗(https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collectionindex.php?tid=6&scode=21&sscode=1&target_type=1&group_id=4)

மேலும் விவரங்களுக்கு கோயில் அலுவலகத்தை அணுகவும்.
`,

  ANNADHANAM: `
*🍚 அன்னதான கட்டணம் & விவரங்கள்*

- அனைத்து நாள்களிலும் அன்னதானத்திற்கு நன்கொடை செலுத்தலாம்.  
  நேரிலோ அல்லது இணைய வழி வாயிலாகவோ செலுத்தலாம்.
- தங்களின் பிறந்த நாள், திருமண நாள் போன்ற முதன்மையான நாள்களுக்கு 
  நன்கொடை செலுத்தி அன்னதானம் வழங்கலாம்.

*அன்னதானத் திட்டம் நன்கொடை விவரம்*
- 100 நபர்களுக்கு நாள் 1-க்கு ரூ.3500/-
- 500 நபர்களுக்கு நாள் 1-க்கு ரூ.17500/-(கிருத்திகை நாள்களில் மட்டும்)
- 1000 நபர்களுக்கு முதலீடு ரூ.75000/- (ஒவ்வொர் ஆண்டிலும் ஒரு நாள் மட்டும்)

*தங்களின் பெயர் அன்னதானக் கூடத்தின் அறிவிப்புப் பலகையில் போடப்படும்*
`,

NANKODAI: `
*🎁 நன்கொடை*

- அனைத்து நாள்களிலும் நன்கொடை செலுத்தலாம்.  நேரிலோ அல்லது இணைய வழி வாயிலாகவோ செலுத்தலாம்.

🌐 இணைய வழி நன்கொடை செலுத்த 👉 
https://vadapalaniandavar.hrce.tn.gov.in/hrcehome/eservices_search.php?activity=eservices&tid=6&catcode=21&group_id=0
`,

  MUDIKANIKAI: `
*💐 முடிகாணிக்கை*

- முடிக்காணிக்கைக் கட்டணம் கிடையாது. அனைத்து நாள்களிலும் முடிக்காணிக்கை செலுத்தலாம். குளியலறை, வெந்நீர் வசதி உள்ளது.
- முடிக்காணிக்கை செலுத்தும் நேரம்: 
   காலை 06.00 மணி முதல் பிற்பகல் 12.00 மணி வரை 
   மாலை 04.00 மணி முதல் 06.00 மணி வரை

`,

  PARKING: `
*🚗 வாகன நிறுத்துமிடம்  & கட்டண விவரம்*

1. இரண்டு சக்கரம்
- திருக்கோயிலின் தெற்குக் கோபுரம் முன்பு உள்ள நான்கு முனைச் சந்திப்பில் இரண்டு சக்கர வண்டி நிறுத்தம் உள்ளது.
- இரண்டு சக்கர வண்டி நிறுத்தக் கட்டணம் ரூ.5/-

2.மூன்று / நான்கு சக்கரம்
- திருக்கோயில் வடக்குப் புறம் உள்ள திருக்கோயிலின் திருமண மண்டபம் எதிரே மூன்று / நான்கு சக்கர வண்டி நிறுத்தம் உள்ளது.
- மூன்று / நான்கு சக்கர வண்டி நிறுத்தக் கட்டணம் ரூ.20/-
- வேன் நிறுத்தக் கட்டணம் ரூ.50/-
`,

  MARRIAGE: `
*💍 திருமணம்*

திருக்கோயிலில் திருமணம் பதிவு செய்ய பின்வரும் ஆவணங்களுள் முதல் மூன்று ஆவணங்களின் உண்மை ஆவணங்களைக் காண்பித்து ரூ.50/- செலுத்தி திருமணப் பதிவினை மேற்கொள்ளலாம்.

*திருமணத்திற்குத் தேவையான ஆவணங்கள்:*
- மணமக்கள் இருவரின் ஆதார் அட்டை
- மணமக்கள் இருவரின் பெற்றோர் ஆதார் அட்டை (பெற்றோர் இல்லையென்றால் இறப்புச் சான்றிதழ் சமர்ப்பிக்க வேண்டும்)
- மணமக்கள் இருவரின் குடும்ப அட்டை 
- மணமக்கள் இருவரின் சாதிச் சான்றிதழ் (அ) பள்ளி மாற்றுச் சான்றிதழ் (இந்து என குறிப்பிடப்பட்டிருக்க வேண்டும்)
- மணமக்கள் இருவரின் பத்தாம் வகுப்பு மதிப்பெண் சான்றிதழ்
- மணமக்கள் இருவருக்கும் திருமணம் ஆகாதவர் என்பதற்கு இ-சேவை மையத்தின் மூலம் பெறப்பட்ட சான்று (முதல் திருமணச் சான்று)
- இரண்டாவது திருமணம் என்றால் மணமுறிவுச் சான்றிதழ்
- மணமக்கள் இருவரின் புகைப்படம் பாஸ்போர்ட் சைஸ் -2

  *திருமணக்கட்டண விவரம்*
- திருமணக் கட்டணம்	ரூ. 2000/-
- திருமண ஹோம மற்றும் மாலைகள்	ரூ.2165/-
- போட்டோ எடுக்க அனுமதி கட்டணம்	ரூ.500/-
- வீடியோ எடுக்க அனுமதிக் கட்டணம்	ரூ.1000/-
*மொத்தம் - ரூ.5665/-*

`
};

module.exports = MESSAGES;
