// utils/messages.js

const MESSAGES = {
DARISANAM: `
🌸 *தரிசன நேரங்கள் (Darisanam Timings)*

*வார நாட்கள் (Mon – Sun):*
- காலை  5:00 மணி — 12:30 மணி
- மாலை  4:00 மணி — 9:00 மணி

*செவ்வாய் & வெள்ளி:*
- காலை  5:00 மணி — 12:30 மணி
- மாலை  4:00 மணி — 9:30 மணி

*கிருத்திகை நாட்கள்:*
- அதிகாலை 4:00 மணி — இரவு 10:30 மணி

*⚠️ திருவிழா காலங்களில் நேரம் மாறதற்கு உபட்டது ⚠️*
`,


  ABISHEGAM_TIME: `
🕉️ *அபிஷேக நேரம் & அலங்கார விவரம்*

🌼 *பள்ளியறை பூஜை (சாதாரண அலங்காரம்)*
- காலை 5.30 மணி முதல் காலை 6.00 மணி வரை

🌼 *காலசந்தி பூஜை (சாதாரண அலங்காரம்)*
- காலை 6.30 மணி முதல் காலை 6.45 மணி வரை

🌼 *உச்சிக்கால பூஜை (சந்தனகாப்பு)*
- மதியம் 12.00 மணி முதல் மதியம் 12.30 மணி வரை

🌼 *சாயரட்சை பூஜை (சந்தனகாப்பு)*
- மாலை 5.00 மணி முதல் மாலை 6.45 மணி வரை

🌼 *அர்த்தஜாம பூஜை (அலங்காரம் இல்லை)*
- இரவு 9.00 மணி
`,

ABISHEGAM_FEES: `
💰 *அபிஷேக கட்டணங்கள்*

- 108 சங்காபிஷேகம் – ₹6,500  
  🔗 [பணம் செலுத்த](https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collection.php?tid=6&scode=21&sscode=1&target_type=&fees_slno=33062&group_id=4&action=P)

- சந்தனக்காப்பு (காலை 11:00 & மாலை 05:00) – ₹3,700  
  🔗 [பணம் செலுத்த](https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collection.php?tid=6&scode=21&sscode=1&target_type=&fees_slno=33898&group_id=4&action=P)

- விபூதி பஞ்சாமிர்த அபிஷேகம் (சித்தர் ஆலயம்) – ₹1,700  

- பால் அபிஷேகம் – ₹700  
  🔗 [பணம் செலுத்த](https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collection.php?tid=6&scode=21&sscode=1&target_type=&fees_slno=94712&group_id=4&action=P)

📞 மேலும் விவரங்களுக்கு ஆலய அலுவலகத்தை அணுகவும்.
`
,

KATTANA_FEES: `
📜 *கட்டண விவரங்கள்*

- அன்னைத் தமிழ் அர்ச்சனை – ₹5  
  🔗 [பணம் செலுத்த](https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collection.php?tid=6&scode=21&sscode=1&target_type=&fees_slno=84054&group_id=4&action=P)

- அர்ச்சனை டிக்கெட் (1க்கு) – ₹5  
  🔗 [பணம் செலுத்த](https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collection.php?tid=6&scode=21&sscode=1&target_type=&fees_slno=3291&group_id=4&action=P)

- சிறப்பு அனுமதி (விழாக்காலங்களில்) – ₹100  

- சிறப்பு நுழைவு சாதாரண நாட்கள் (நபர் 1க்கு) – ₹50  
  🔗 [பணம் செலுத்த](https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collection.php?tid=6&scode=21&sscode=1&target_type=&fees_slno=93685&group_id=4&action=P)

- காது குத்த (நபர் 1க்கு) – ₹100  
  🔗 [பணம் செலுத்த](https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collection.php?tid=6&scode=21&sscode=1&target_type=&fees_slno=3506&group_id=4&action=P)

- முடிக்கான காணிக்கை (நபர் 1க்கு) – இலவசம்
`
,

PRARTHANA: `
🙏 *பிரார்த்தனை கட்டணங்கள்*

- திருக்கல்யாணம் நடத்த – ₹8,500  
- தங்கரதம் இழுக்க – ₹2,500  
- வடை மாலை சாத்த – ₹700  
- நெய்த் திட்டம் – ₹7,500  
- நல்லெண்ணெய்த் திட்டம் – ₹6,000  
- நாள் முழுவதும் பிரசாதம் – ₹5,000  
- துலாபாரத் திட்டம் – ₹15  
- நெய் விளக்கு (எண்ணிக்கை 2) – ₹15  
- நல்லெண்ணெய் விளக்கு (எண்ணிக்கை 2) – ₹15  
  🔗 [பணம் செலுத்த](https://vadapalaniandavar.hrce.tn.gov.in/ticketing/service_collectionindex.php?tid=6&scode=21&sscode=1&target_type=1&group_id=4)
`
,

  PRASADHA: `
*🍛 பிரசாதம்*

பிரசாத திட்ட விவரம்:
- நாளொன்றுக்கு 500 பேருக்கு
- தனிப்பட்ட பிரசாதம்: ₹50
மேலும் விவரங்களுக்கு கோயில் அலுவலகத்தை அணுகவும்.
`,

  ANNADHANAM: `
*🍚 அன்னதானம்*

எல்லா நாட்களும் அன்னதானத்திற்கு நன்கொடை செலுத்தலாம். நேரிலோ அல்லது இணைய வழி வாயிலாகவோ செலுத்தலாம். 

தங்களின் பிறந்த நாள், திருமண நாள் போன்ற முக்கிய நாட்களுக்கு நன்கொடை செலுத்தி அன்னதானம் வழங்கலாம். 

தங்களின் பெயர் அறிவிப்பு பலகையில் போடப்படும். 
`,

NANKODAI: `
*🎁 நன்கொடை*

எல்லா நாட்களும் நன்கொடை செலுத்தலாம். நேரிலோ அல்லது இணைய வழி வாயிலாகவோ செலுத்தலாம். 

🌐 இணைய வழி நன்கொடை செலுத்த 👉 
https://vadapalaniandavar.hrce.tn.gov.in/hrcehome/eservices_search.php?activity=eservices&tid=6&catcode=21&group_id=0
`,

  MUDIKANIKAI: `
*💐 முடிகாணிக்கை*

முடிகாணிக்கை கட்டணம் கிடையாது. எல்லா நாட்களும் முடிகாணிக்கை செலுத்த வசதி உள்ளது.

அருகிலே குளியலறை உள்ளது. சுடு தண்ணீர் வசதி உள்ளது. 
`,

  PARKING: `
*🚗 பார்க்கிங்*

1. மூன்று இடங்களில் இரண்டு சக்கர வாகனம் நிறுத்தம் உள்ளது. 

வாகன நிறுத்த கட்டணம் - Rs 5/- 

a. நான்கு முனை சந்திப்பு (தெற்கு)
b. திருக்குளத்தின் வடக்கு புறம்
c. கோசாலை அருகில்

2. நான்கு சக்கர வாகன நிறுத்தம் 

வாகன நிறுத்த கட்டணம் - Rs 20/- 

திருக்கோயில் வடக்கு புறம் உள்ள திருக்கோயிலின் கல்யாண மண்டபம் எதிரே உள்ளது.
`,

  MARRIAGE: `
*💍 திருமணம்*

திருக்கோவிலில் திருமணம் செய்ய
தேவையான சான்றிதழ்களை சமர்பித்து விண்ணப்படிவத்தை பெற வேண்டும்

தேவையான சான்றிதழ்கள்

மணமகன் மற்றும் மனமகள் இருவருக்கும்

1. ஆதார் கார்டு
2. PAN கார்டு
3. கல்வி சான்றிதழ்கள்
4. சாதி சான்றிதழ் or TC 
5. முதல் திருமணம் சான்றிதழ்


கட்டண விவரம்:

- திருமணம் நடத்த இடஒதுக்கீடு  - 2,000.00
- புகைப்படம் எடுக்க அனுமதி - 500.00  
- வீடியோ எடுக்க அனுமதி  -1,000.00

மொத்தம் கட்டணம் Rs 5565/-

`
};

module.exports = MESSAGES;
